Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/**
 * \file IfxEdsadc_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:05:47 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Edsadc_Registers_Cfg Edsadc address
 * \ingroup IfxLld_Edsadc_Registers
 * 
 * \defgroup IfxLld_Edsadc_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Edsadc_Registers_Cfg
 *
 * \defgroup IfxLld_Edsadc_Registers_Cfg_Edsadc 2-EDSADC
 * \ingroup IfxLld_Edsadc_Registers_Cfg
 *
 *
 */
#ifndef IFXEDSADC_REG_H
#define IFXEDSADC_REG_H 1
/******************************************************************************/
#include "IfxEdsadc_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Edsadc_Cfg_BaseAddress
 * \{  */

/** \brief EDSADC object */
#define MODULE_EDSADC /*lint --e(923)*/ ((*(Ifx_EDSADC*)0xF0024000u))
/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Edsadc_Cfg_Edsadc
 * \{  */
/** \brief 0, Clock Control Register */
#define EDSADC_CLC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CLC*)0xF0024000u)

/** \brief 8, Module Identification Register */
#define EDSADC_ID /*lint --e(923)*/ (*(volatile Ifx_EDSADC_ID*)0xF0024008u)

/** \brief 28, OCDS Control and Status Register */
#define EDSADC_OCS /*lint --e(923)*/ (*(volatile Ifx_EDSADC_OCS*)0xF0024028u)

/** \brief 2C, Kernel Reset Status Clear Register */
#define EDSADC_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_KRSTCLR*)0xF002402Cu)

/** \brief 30, Kernel Reset Register 1 */
#define EDSADC_KRST1 /*lint --e(923)*/ (*(volatile Ifx_EDSADC_KRST1*)0xF0024030u)

/** \brief 34, Kernel Reset Register 0 */
#define EDSADC_KRST0 /*lint --e(923)*/ (*(volatile Ifx_EDSADC_KRST0*)0xF0024034u)

/** \brief 38, Access Enable Register 1 */
#define EDSADC_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EDSADC_ACCEN1*)0xF0024038u)

/** \brief 3C, Access Enable Register 0 */
#define EDSADC_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EDSADC_ACCEN0*)0xF002403Cu)

/** \brief 80, Global Configuration Register */
#define EDSADC_GLOBCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_GLOBCFG*)0xF0024080u)

/** \brief 88, Global Run Control Register */
#define EDSADC_GLOBRC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_GLOBRC*)0xF0024088u)

/** \brief 90, Access Protection Register */
#define EDSADC_ACCPROT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_ACCPROT*)0xF0024090u)

/** \brief A0, Carrier Generator Configuration Register */
#define EDSADC_CGCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CGCFG*)0xF00240A0u)

/** \brief E0, Event Flag Register */
#define EDSADC_EVFLAG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_EVFLAG*)0xF00240E0u)

/** \brief E4, Event Flag Clear Register */
#define EDSADC_EVFLAGCLR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_EVFLAGCLR*)0xF00240E4u)

/** \brief 100, Modulator Configuration Register ${i} */
#define EDSADC_CH0_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024100u)
/** Alias (User Manual Name) for EDSADC_CH0_MODCFG.
* To use register names with standard convension, please use EDSADC_CH0_MODCFG.
*/
#define EDSADC_MODCFG0 (EDSADC_CH0_MODCFG)

/** \brief 108, Demodulator Input Config. Register ${i} */
#define EDSADC_CH0_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024108u)
/** Alias (User Manual Name) for EDSADC_CH0_DICFG.
* To use register names with standard convension, please use EDSADC_CH0_DICFG.
*/
#define EDSADC_DICFG0 (EDSADC_CH0_DICFG)

/** \brief 110, Filter Configuration Register ${i}, Main */
#define EDSADC_CH0_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024110u)
/** Alias (User Manual Name) for EDSADC_CH0_FCFGM.
* To use register names with standard convension, please use EDSADC_CH0_FCFGM.
*/
#define EDSADC_FCFGM0 (EDSADC_CH0_FCFGM)

/** \brief 114, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH0_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024114u)
/** Alias (User Manual Name) for EDSADC_CH0_FCFGC.
* To use register names with standard convension, please use EDSADC_CH0_FCFGC.
*/
#define EDSADC_FCFGC0 (EDSADC_CH0_FCFGC)

/** \brief 118, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH0_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024118u)
/** Alias (User Manual Name) for EDSADC_CH0_FCNTC.
* To use register names with standard convension, please use EDSADC_CH0_FCNTC.
*/
#define EDSADC_FCNTC0 (EDSADC_CH0_FCNTC)

/** \brief 120, Integration Window Control Register ${i} */
#define EDSADC_CH0_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024120u)
/** Alias (User Manual Name) for EDSADC_CH0_IWCTR.
* To use register names with standard convension, please use EDSADC_CH0_IWCTR.
*/
#define EDSADC_IWCTR0 (EDSADC_CH0_IWCTR)

/** \brief 124, Intermediate Integration Value */
#define EDSADC_CH0_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024124u)
/** Alias (User Manual Name) for EDSADC_CH0_IIVAL.
* To use register names with standard convension, please use EDSADC_CH0_IIVAL.
*/
#define EDSADC_IIVAL0 (EDSADC_CH0_IIVAL)

/** \brief 128, Integrator Status Register ${i} */
#define EDSADC_CH0_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024128u)
/** Alias (User Manual Name) for EDSADC_CH0_ISTAT.
* To use register names with standard convension, please use EDSADC_CH0_ISTAT.
*/
#define EDSADC_ISTAT0 (EDSADC_CH0_ISTAT)

/** \brief 12C, Result FIFO Control Register ${i} */
#define EDSADC_CH0_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002412Cu)
/** Alias (User Manual Name) for EDSADC_CH0_RFC.
* To use register names with standard convension, please use EDSADC_CH0_RFC.
*/
#define EDSADC_RFC0 (EDSADC_CH0_RFC)

