Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 130, Result Register ${i} Main */
#define EDSADC_CH0_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024130u)
/** Alias (User Manual Name) for EDSADC_CH0_RESM.
* To use register names with standard convension, please use EDSADC_CH0_RESM.
*/
#define EDSADC_RESM0 (EDSADC_CH0_RESM)

/** \brief 138, Offset Compensation Register ${i} */
#define EDSADC_CH0_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024138u)
/** Alias (User Manual Name) for EDSADC_CH0_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH0_OFFCOMP.
*/
#define EDSADC_OFFCOMP0 (EDSADC_CH0_OFFCOMP)

/** \brief 13C, Gain Calibration Register ${i} */
#define EDSADC_CH0_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002413Cu)
/** Alias (User Manual Name) for EDSADC_CH0_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH0_GAINCAL.
*/
#define EDSADC_GAINCAL0 (EDSADC_CH0_GAINCAL)

/** \brief 140, Gain Control Register ${i} */
#define EDSADC_CH0_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024140u)
/** Alias (User Manual Name) for EDSADC_CH0_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH0_GAINCTR.
*/
#define EDSADC_GAINCTR0 (EDSADC_CH0_GAINCTR)

/** \brief 144, Gain Correction Register ${i} */
#define EDSADC_CH0_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024144u)
/** Alias (User Manual Name) for EDSADC_CH0_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH0_GAINCORR.
*/
#define EDSADC_GAINCORR0 (EDSADC_CH0_GAINCORR)

/** \brief 150, Time-Stamp Register ${i} */
#define EDSADC_CH0_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024150u)
/** Alias (User Manual Name) for EDSADC_CH0_TSTMP.
* To use register names with standard convension, please use EDSADC_CH0_TSTMP.
*/
#define EDSADC_TSTMP0 (EDSADC_CH0_TSTMP)

/** \brief 154, Time-Stamp Counter ${i} */
#define EDSADC_CH0_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024154u)
/** Alias (User Manual Name) for EDSADC_CH0_TSCNT.
* To use register names with standard convension, please use EDSADC_CH0_TSCNT.
*/
#define EDSADC_TSCNT0 (EDSADC_CH0_TSCNT)

/** \brief 170, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH0_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024170u)
/** Alias (User Manual Name) for EDSADC_CH0_FCFGA.
* To use register names with standard convension, please use EDSADC_CH0_FCFGA.
*/
#define EDSADC_FCFGA0 (EDSADC_CH0_FCFGA)

/** \brief 178, Boundary Select Register ${i} */
#define EDSADC_CH0_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024178u)
/** Alias (User Manual Name) for EDSADC_CH0_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH0_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL0 (EDSADC_CH0_BOUNDSEL)

/** \brief 180, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH0_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024180u)
/** Alias (User Manual Name) for EDSADC_CH0_RESA.
* To use register names with standard convension, please use EDSADC_CH0_RESA.
*/
#define EDSADC_RESA0 (EDSADC_CH0_RESA)

/** \brief 1A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH0_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00241A0u)
/** Alias (User Manual Name) for EDSADC_CH0_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH0_CGSYNC.
*/
#define EDSADC_CGSYNC0 (EDSADC_CH0_CGSYNC)

/** \brief 1A8, Rectification Configuration Register ${i} */
#define EDSADC_CH0_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00241A8u)
/** Alias (User Manual Name) for EDSADC_CH0_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH0_RECTCFG.
*/
#define EDSADC_RECTCFG0 (EDSADC_CH0_RECTCFG)

/** \brief 1B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH0_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00241B0u)
/** Alias (User Manual Name) for EDSADC_CH0_VCM.
* To use register names with standard convension, please use EDSADC_CH0_VCM.
*/
#define EDSADC_VCM0 (EDSADC_CH0_VCM)

/** \brief 200, Modulator Configuration Register ${i} */
#define EDSADC_CH1_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024200u)
/** Alias (User Manual Name) for EDSADC_CH1_MODCFG.
* To use register names with standard convension, please use EDSADC_CH1_MODCFG.
*/
#define EDSADC_MODCFG1 (EDSADC_CH1_MODCFG)

/** \brief 208, Demodulator Input Config. Register ${i} */
#define EDSADC_CH1_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024208u)
/** Alias (User Manual Name) for EDSADC_CH1_DICFG.
* To use register names with standard convension, please use EDSADC_CH1_DICFG.
*/
#define EDSADC_DICFG1 (EDSADC_CH1_DICFG)

/** \brief 210, Filter Configuration Register ${i}, Main */
#define EDSADC_CH1_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024210u)
/** Alias (User Manual Name) for EDSADC_CH1_FCFGM.
* To use register names with standard convension, please use EDSADC_CH1_FCFGM.
*/
#define EDSADC_FCFGM1 (EDSADC_CH1_FCFGM)

/** \brief 214, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH1_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024214u)
/** Alias (User Manual Name) for EDSADC_CH1_FCFGC.
* To use register names with standard convension, please use EDSADC_CH1_FCFGC.
*/
#define EDSADC_FCFGC1 (EDSADC_CH1_FCFGC)

/** \brief 218, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH1_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024218u)
/** Alias (User Manual Name) for EDSADC_CH1_FCNTC.
* To use register names with standard convension, please use EDSADC_CH1_FCNTC.
*/
#define EDSADC_FCNTC1 (EDSADC_CH1_FCNTC)

/** \brief 220, Integration Window Control Register ${i} */
#define EDSADC_CH1_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024220u)
/** Alias (User Manual Name) for EDSADC_CH1_IWCTR.
* To use register names with standard convension, please use EDSADC_CH1_IWCTR.
*/
#define EDSADC_IWCTR1 (EDSADC_CH1_IWCTR)

/** \brief 224, Intermediate Integration Value */
#define EDSADC_CH1_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024224u)
/** Alias (User Manual Name) for EDSADC_CH1_IIVAL.
* To use register names with standard convension, please use EDSADC_CH1_IIVAL.
*/
#define EDSADC_IIVAL1 (EDSADC_CH1_IIVAL)

/** \brief 228, Integrator Status Register ${i} */
#define EDSADC_CH1_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024228u)
/** Alias (User Manual Name) for EDSADC_CH1_ISTAT.
* To use register names with standard convension, please use EDSADC_CH1_ISTAT.
*/
#define EDSADC_ISTAT1 (EDSADC_CH1_ISTAT)

/** \brief 22C, Result FIFO Control Register ${i} */
#define EDSADC_CH1_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002422Cu)
/** Alias (User Manual Name) for EDSADC_CH1_RFC.
* To use register names with standard convension, please use EDSADC_CH1_RFC.
*/
#define EDSADC_RFC1 (EDSADC_CH1_RFC)

/** \brief 230, Result Register ${i} Main */
#define EDSADC_CH1_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024230u)
/** Alias (User Manual Name) for EDSADC_CH1_RESM.
* To use register names with standard convension, please use EDSADC_CH1_RESM.
*/
#define EDSADC_RESM1 (EDSADC_CH1_RESM)

/** \brief 238, Offset Compensation Register ${i} */
#define EDSADC_CH1_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024238u)
/** Alias (User Manual Name) for EDSADC_CH1_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH1_OFFCOMP.
*/
#define EDSADC_OFFCOMP1 (EDSADC_CH1_OFFCOMP)

/** \brief 23C, Gain Calibration Register ${i} */
#define EDSADC_CH1_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002423Cu)
/** Alias (User Manual Name) for EDSADC_CH1_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH1_GAINCAL.
*/
#define EDSADC_GAINCAL1 (EDSADC_CH1_GAINCAL)

/** \brief 240, Gain Control Register ${i} */
#define EDSADC_CH1_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024240u)
/** Alias (User Manual Name) for EDSADC_CH1_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH1_GAINCTR.
*/
#define EDSADC_GAINCTR1 (EDSADC_CH1_GAINCTR)

/** \brief 244, Gain Correction Register ${i} */
#define EDSADC_CH1_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024244u)
/** Alias (User Manual Name) for EDSADC_CH1_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH1_GAINCORR.
*/
#define EDSADC_GAINCORR1 (EDSADC_CH1_GAINCORR)

/** \brief 250, Time-Stamp Register ${i} */
#define EDSADC_CH1_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024250u)
/** Alias (User Manual Name) for EDSADC_CH1_TSTMP.
* To use register names with standard convension, please use EDSADC_CH1_TSTMP.
*/
#define EDSADC_TSTMP1 (EDSADC_CH1_TSTMP)

/** \brief 254, Time-Stamp Counter ${i} */
#define EDSADC_CH1_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024254u)
/** Alias (User Manual Name) for EDSADC_CH1_TSCNT.
* To use register names with standard convension, please use EDSADC_CH1_TSCNT.
*/
#define EDSADC_TSCNT1 (EDSADC_CH1_TSCNT)

/** \brief 270, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH1_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024270u)
/** Alias (User Manual Name) for EDSADC_CH1_FCFGA.
* To use register names with standard convension, please use EDSADC_CH1_FCFGA.
*/
#define EDSADC_FCFGA1 (EDSADC_CH1_FCFGA)

