Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 278, Boundary Select Register ${i} */
#define EDSADC_CH1_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024278u)
/** Alias (User Manual Name) for EDSADC_CH1_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH1_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL1 (EDSADC_CH1_BOUNDSEL)

/** \brief 280, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH1_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024280u)
/** Alias (User Manual Name) for EDSADC_CH1_RESA.
* To use register names with standard convension, please use EDSADC_CH1_RESA.
*/
#define EDSADC_RESA1 (EDSADC_CH1_RESA)

/** \brief 2A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH1_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00242A0u)
/** Alias (User Manual Name) for EDSADC_CH1_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH1_CGSYNC.
*/
#define EDSADC_CGSYNC1 (EDSADC_CH1_CGSYNC)

/** \brief 2A8, Rectification Configuration Register ${i} */
#define EDSADC_CH1_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00242A8u)
/** Alias (User Manual Name) for EDSADC_CH1_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH1_RECTCFG.
*/
#define EDSADC_RECTCFG1 (EDSADC_CH1_RECTCFG)

/** \brief 2B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH1_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00242B0u)
/** Alias (User Manual Name) for EDSADC_CH1_VCM.
* To use register names with standard convension, please use EDSADC_CH1_VCM.
*/
#define EDSADC_VCM1 (EDSADC_CH1_VCM)

/** \brief 300, Modulator Configuration Register ${i} */
#define EDSADC_CH2_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024300u)
/** Alias (User Manual Name) for EDSADC_CH2_MODCFG.
* To use register names with standard convension, please use EDSADC_CH2_MODCFG.
*/
#define EDSADC_MODCFG2 (EDSADC_CH2_MODCFG)

/** \brief 308, Demodulator Input Config. Register ${i} */
#define EDSADC_CH2_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024308u)
/** Alias (User Manual Name) for EDSADC_CH2_DICFG.
* To use register names with standard convension, please use EDSADC_CH2_DICFG.
*/
#define EDSADC_DICFG2 (EDSADC_CH2_DICFG)

/** \brief 310, Filter Configuration Register ${i}, Main */
#define EDSADC_CH2_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024310u)
/** Alias (User Manual Name) for EDSADC_CH2_FCFGM.
* To use register names with standard convension, please use EDSADC_CH2_FCFGM.
*/
#define EDSADC_FCFGM2 (EDSADC_CH2_FCFGM)

/** \brief 314, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH2_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024314u)
/** Alias (User Manual Name) for EDSADC_CH2_FCFGC.
* To use register names with standard convension, please use EDSADC_CH2_FCFGC.
*/
#define EDSADC_FCFGC2 (EDSADC_CH2_FCFGC)

/** \brief 318, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH2_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024318u)
/** Alias (User Manual Name) for EDSADC_CH2_FCNTC.
* To use register names with standard convension, please use EDSADC_CH2_FCNTC.
*/
#define EDSADC_FCNTC2 (EDSADC_CH2_FCNTC)



/** \brief 320, Integration Window Control Register ${i} */
#define EDSADC_CH2_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024320u)
/** Alias (User Manual Name) for EDSADC_CH2_IWCTR.
* To use register names with standard convension, please use EDSADC_CH2_IWCTR.
*/
#define EDSADC_IWCTR2 (EDSADC_CH2_IWCTR)

/** \brief 324, Intermediate Integration Value */
#define EDSADC_CH2_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024324u)
/** Alias (User Manual Name) for EDSADC_CH2_IIVAL.
* To use register names with standard convension, please use EDSADC_CH2_IIVAL.
*/
#define EDSADC_IIVAL2 (EDSADC_CH2_IIVAL)

/** \brief 328, Integrator Status Register ${i} */
#define EDSADC_CH2_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024328u)
/** Alias (User Manual Name) for EDSADC_CH2_ISTAT.
* To use register names with standard convension, please use EDSADC_CH2_ISTAT.
*/
#define EDSADC_ISTAT2 (EDSADC_CH2_ISTAT)

/** \brief 32C, Result FIFO Control Register ${i} */
#define EDSADC_CH2_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002432Cu)
/** Alias (User Manual Name) for EDSADC_CH2_RFC.
* To use register names with standard convension, please use EDSADC_CH2_RFC.
*/
#define EDSADC_RFC2 (EDSADC_CH2_RFC)

/** \brief 330, Result Register ${i} Main */
#define EDSADC_CH2_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024330u)
/** Alias (User Manual Name) for EDSADC_CH2_RESM.
* To use register names with standard convension, please use EDSADC_CH2_RESM.
*/
#define EDSADC_RESM2 (EDSADC_CH2_RESM)

/** \brief 338, Offset Compensation Register ${i} */
#define EDSADC_CH2_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024338u)
/** Alias (User Manual Name) for EDSADC_CH2_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH2_OFFCOMP.
*/
#define EDSADC_OFFCOMP2 (EDSADC_CH2_OFFCOMP)

/** \brief 33C, Gain Calibration Register ${i} */
#define EDSADC_CH2_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002433Cu)
/** Alias (User Manual Name) for EDSADC_CH2_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH2_GAINCAL.
*/
#define EDSADC_GAINCAL2 (EDSADC_CH2_GAINCAL)

/** \brief 340, Gain Control Register ${i} */
#define EDSADC_CH2_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024340u)
/** Alias (User Manual Name) for EDSADC_CH2_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH2_GAINCTR.
*/
#define EDSADC_GAINCTR2 (EDSADC_CH2_GAINCTR)

/** \brief 344, Gain Correction Register ${i} */
#define EDSADC_CH2_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024344u)
/** Alias (User Manual Name) for EDSADC_CH2_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH2_GAINCORR.
*/
#define EDSADC_GAINCORR2 (EDSADC_CH2_GAINCORR)

/** \brief 350, Time-Stamp Register ${i} */
#define EDSADC_CH2_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024350u)
/** Alias (User Manual Name) for EDSADC_CH2_TSTMP.
* To use register names with standard convension, please use EDSADC_CH2_TSTMP.
*/
#define EDSADC_TSTMP2 (EDSADC_CH2_TSTMP)

