Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 354, Time-Stamp Counter ${i} */
#define EDSADC_CH2_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024354u)
/** Alias (User Manual Name) for EDSADC_CH2_TSCNT.
* To use register names with standard convension, please use EDSADC_CH2_TSCNT.
*/
#define EDSADC_TSCNT2 (EDSADC_CH2_TSCNT)

/** \brief 370, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH2_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024370u)
/** Alias (User Manual Name) for EDSADC_CH2_FCFGA.
* To use register names with standard convension, please use EDSADC_CH2_FCFGA.
*/
#define EDSADC_FCFGA2 (EDSADC_CH2_FCFGA)

/** \brief 378, Boundary Select Register ${i} */
#define EDSADC_CH2_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024378u)
/** Alias (User Manual Name) for EDSADC_CH2_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH2_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL2 (EDSADC_CH2_BOUNDSEL)

/** \brief 380, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH2_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024380u)
/** Alias (User Manual Name) for EDSADC_CH2_RESA.
* To use register names with standard convension, please use EDSADC_CH2_RESA.
*/
#define EDSADC_RESA2 (EDSADC_CH2_RESA)

/** \brief 3A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH2_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00243A0u)
/** Alias (User Manual Name) for EDSADC_CH2_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH2_CGSYNC.
*/
#define EDSADC_CGSYNC2 (EDSADC_CH2_CGSYNC)

/** \brief 3A8, Rectification Configuration Register ${i} */
#define EDSADC_CH2_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00243A8u)
/** Alias (User Manual Name) for EDSADC_CH2_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH2_RECTCFG.
*/
#define EDSADC_RECTCFG2 (EDSADC_CH2_RECTCFG)

/** \brief 3B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH2_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00243B0u)
/** Alias (User Manual Name) for EDSADC_CH2_VCM.
* To use register names with standard convension, please use EDSADC_CH2_VCM.
*/
#define EDSADC_VCM2 (EDSADC_CH2_VCM)

/** \brief 400, Modulator Configuration Register ${i} */
#define EDSADC_CH3_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024400u)
/** Alias (User Manual Name) for EDSADC_CH3_MODCFG.
* To use register names with standard convension, please use EDSADC_CH3_MODCFG.
*/
#define EDSADC_MODCFG3 (EDSADC_CH3_MODCFG)

/** \brief 408, Demodulator Input Config. Register ${i} */
#define EDSADC_CH3_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024408u)
/** Alias (User Manual Name) for EDSADC_CH3_DICFG.
* To use register names with standard convension, please use EDSADC_CH3_DICFG.
*/
#define EDSADC_DICFG3 (EDSADC_CH3_DICFG)

/** \brief 410, Filter Configuration Register ${i}, Main */
#define EDSADC_CH3_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024410u)
/** Alias (User Manual Name) for EDSADC_CH3_FCFGM.
* To use register names with standard convension, please use EDSADC_CH3_FCFGM.
*/
#define EDSADC_FCFGM3 (EDSADC_CH3_FCFGM)

/** \brief 414, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH3_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024414u)
/** Alias (User Manual Name) for EDSADC_CH3_FCFGC.
* To use register names with standard convension, please use EDSADC_CH3_FCFGC.
*/
#define EDSADC_FCFGC3 (EDSADC_CH3_FCFGC)

/** \brief 418, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH3_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024418u)
/** Alias (User Manual Name) for EDSADC_CH3_FCNTC.
* To use register names with standard convension, please use EDSADC_CH3_FCNTC.
*/
#define EDSADC_FCNTC3 (EDSADC_CH3_FCNTC)

/** \brief 420, Integration Window Control Register ${i} */
#define EDSADC_CH3_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024420u)
/** Alias (User Manual Name) for EDSADC_CH3_IWCTR.
* To use register names with standard convension, please use EDSADC_CH3_IWCTR.
*/
#define EDSADC_IWCTR3 (EDSADC_CH3_IWCTR)

/** \brief 424, Intermediate Integration Value */
#define EDSADC_CH3_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024424u)
/** Alias (User Manual Name) for EDSADC_CH3_IIVAL.
* To use register names with standard convension, please use EDSADC_CH3_IIVAL.
*/
#define EDSADC_IIVAL3 (EDSADC_CH3_IIVAL)

/** \brief 428, Integrator Status Register ${i} */
#define EDSADC_CH3_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024428u)
/** Alias (User Manual Name) for EDSADC_CH3_ISTAT.
* To use register names with standard convension, please use EDSADC_CH3_ISTAT.
*/
#define EDSADC_ISTAT3 (EDSADC_CH3_ISTAT)

/** \brief 42C, Result FIFO Control Register ${i} */
#define EDSADC_CH3_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002442Cu)
/** Alias (User Manual Name) for EDSADC_CH3_RFC.
* To use register names with standard convension, please use EDSADC_CH3_RFC.
*/
#define EDSADC_RFC3 (EDSADC_CH3_RFC)

/** \brief 430, Result Register ${i} Main */
#define EDSADC_CH3_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024430u)
/** Alias (User Manual Name) for EDSADC_CH3_RESM.
* To use register names with standard convension, please use EDSADC_CH3_RESM.
*/
#define EDSADC_RESM3 (EDSADC_CH3_RESM)

/** \brief 438, Offset Compensation Register ${i} */
#define EDSADC_CH3_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024438u)
/** Alias (User Manual Name) for EDSADC_CH3_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH3_OFFCOMP.
*/
#define EDSADC_OFFCOMP3 (EDSADC_CH3_OFFCOMP)

/** \brief 43C, Gain Calibration Register ${i} */
#define EDSADC_CH3_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002443Cu)
/** Alias (User Manual Name) for EDSADC_CH3_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH3_GAINCAL.
*/
#define EDSADC_GAINCAL3 (EDSADC_CH3_GAINCAL)

/** \brief 440, Gain Control Register ${i} */
#define EDSADC_CH3_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024440u)
/** Alias (User Manual Name) for EDSADC_CH3_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH3_GAINCTR.
*/
#define EDSADC_GAINCTR3 (EDSADC_CH3_GAINCTR)

/** \brief 444, Gain Correction Register ${i} */
#define EDSADC_CH3_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024444u)
/** Alias (User Manual Name) for EDSADC_CH3_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH3_GAINCORR.
*/
#define EDSADC_GAINCORR3 (EDSADC_CH3_GAINCORR)

