Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 450, Time-Stamp Register ${i} */
#define EDSADC_CH3_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024450u)
/** Alias (User Manual Name) for EDSADC_CH3_TSTMP.
* To use register names with standard convension, please use EDSADC_CH3_TSTMP.
*/
#define EDSADC_TSTMP3 (EDSADC_CH3_TSTMP)

/** \brief 454, Time-Stamp Counter ${i} */
#define EDSADC_CH3_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024454u)
/** Alias (User Manual Name) for EDSADC_CH3_TSCNT.
* To use register names with standard convension, please use EDSADC_CH3_TSCNT.
*/
#define EDSADC_TSCNT3 (EDSADC_CH3_TSCNT)

/** \brief 470, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH3_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024470u)
/** Alias (User Manual Name) for EDSADC_CH3_FCFGA.
* To use register names with standard convension, please use EDSADC_CH3_FCFGA.
*/
#define EDSADC_FCFGA3 (EDSADC_CH3_FCFGA)

/** \brief 478, Boundary Select Register ${i} */
#define EDSADC_CH3_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024478u)
/** Alias (User Manual Name) for EDSADC_CH3_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH3_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL3 (EDSADC_CH3_BOUNDSEL)

/** \brief 480, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH3_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024480u)
/** Alias (User Manual Name) for EDSADC_CH3_RESA.
* To use register names with standard convension, please use EDSADC_CH3_RESA.
*/
#define EDSADC_RESA3 (EDSADC_CH3_RESA)

/** \brief 4A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH3_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00244A0u)
/** Alias (User Manual Name) for EDSADC_CH3_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH3_CGSYNC.
*/
#define EDSADC_CGSYNC3 (EDSADC_CH3_CGSYNC)

/** \brief 4A8, Rectification Configuration Register ${i} */
#define EDSADC_CH3_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00244A8u)
/** Alias (User Manual Name) for EDSADC_CH3_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH3_RECTCFG.
*/
#define EDSADC_RECTCFG3 (EDSADC_CH3_RECTCFG)

/** \brief 4B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH3_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00244B0u)
/** Alias (User Manual Name) for EDSADC_CH3_VCM.
* To use register names with standard convension, please use EDSADC_CH3_VCM.
*/
#define EDSADC_VCM3 (EDSADC_CH3_VCM)

/** \brief 500, Modulator Configuration Register ${i} */
#define EDSADC_CH4_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024500u)
/** Alias (User Manual Name) for EDSADC_CH4_MODCFG.
* To use register names with standard convension, please use EDSADC_CH4_MODCFG.
*/
#define EDSADC_MODCFG4 (EDSADC_CH4_MODCFG)

/** \brief 508, Demodulator Input Config. Register ${i} */
#define EDSADC_CH4_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024508u)
/** Alias (User Manual Name) for EDSADC_CH4_DICFG.
* To use register names with standard convension, please use EDSADC_CH4_DICFG.
*/
#define EDSADC_DICFG4 (EDSADC_CH4_DICFG)

/** \brief 510, Filter Configuration Register ${i}, Main */
#define EDSADC_CH4_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024510u)
/** Alias (User Manual Name) for EDSADC_CH4_FCFGM.
* To use register names with standard convension, please use EDSADC_CH4_FCFGM.
*/
#define EDSADC_FCFGM4 (EDSADC_CH4_FCFGM)

/** \brief 514, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH4_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024514u)
/** Alias (User Manual Name) for EDSADC_CH4_FCFGC.
* To use register names with standard convension, please use EDSADC_CH4_FCFGC.
*/
#define EDSADC_FCFGC4 (EDSADC_CH4_FCFGC)

/** \brief 518, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH4_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024518u)
/** Alias (User Manual Name) for EDSADC_CH4_FCNTC.
* To use register names with standard convension, please use EDSADC_CH4_FCNTC.
*/
#define EDSADC_FCNTC4 (EDSADC_CH4_FCNTC)

/** \brief 520, Integration Window Control Register ${i} */
#define EDSADC_CH4_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024520u)
/** Alias (User Manual Name) for EDSADC_CH4_IWCTR.
* To use register names with standard convension, please use EDSADC_CH4_IWCTR.
*/
#define EDSADC_IWCTR4 (EDSADC_CH4_IWCTR)

/** \brief 524, Intermediate Integration Value */
#define EDSADC_CH4_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024524u)
/** Alias (User Manual Name) for EDSADC_CH4_IIVAL.
* To use register names with standard convension, please use EDSADC_CH4_IIVAL.
*/
#define EDSADC_IIVAL4 (EDSADC_CH4_IIVAL)

/** \brief 528, Integrator Status Register ${i} */
#define EDSADC_CH4_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024528u)
/** Alias (User Manual Name) for EDSADC_CH4_ISTAT.
* To use register names with standard convension, please use EDSADC_CH4_ISTAT.
*/
#define EDSADC_ISTAT4 (EDSADC_CH4_ISTAT)

/** \brief 52C, Result FIFO Control Register ${i} */
#define EDSADC_CH4_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002452Cu)
/** Alias (User Manual Name) for EDSADC_CH4_RFC.
* To use register names with standard convension, please use EDSADC_CH4_RFC.
*/
#define EDSADC_RFC4 (EDSADC_CH4_RFC)

/** \brief 530, Result Register ${i} Main */
#define EDSADC_CH4_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024530u)
/** Alias (User Manual Name) for EDSADC_CH4_RESM.
* To use register names with standard convension, please use EDSADC_CH4_RESM.
*/
#define EDSADC_RESM4 (EDSADC_CH4_RESM)

/** \brief 538, Offset Compensation Register ${i} */
#define EDSADC_CH4_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024538u)
/** Alias (User Manual Name) for EDSADC_CH4_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH4_OFFCOMP.
*/
#define EDSADC_OFFCOMP4 (EDSADC_CH4_OFFCOMP)

/** \brief 53C, Gain Calibration Register ${i} */
#define EDSADC_CH4_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002453Cu)
/** Alias (User Manual Name) for EDSADC_CH4_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH4_GAINCAL.
*/
#define EDSADC_GAINCAL4 (EDSADC_CH4_GAINCAL)

