Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 540, Gain Control Register ${i} */
#define EDSADC_CH4_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024540u)
/** Alias (User Manual Name) for EDSADC_CH4_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH4_GAINCTR.
*/
#define EDSADC_GAINCTR4 (EDSADC_CH4_GAINCTR)

/** \brief 544, Gain Correction Register ${i} */
#define EDSADC_CH4_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024544u)
/** Alias (User Manual Name) for EDSADC_CH4_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH4_GAINCORR.
*/
#define EDSADC_GAINCORR4 (EDSADC_CH4_GAINCORR)

/** \brief 550, Time-Stamp Register ${i} */
#define EDSADC_CH4_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024550u)
/** Alias (User Manual Name) for EDSADC_CH4_TSTMP.
* To use register names with standard convension, please use EDSADC_CH4_TSTMP.
*/
#define EDSADC_TSTMP4 (EDSADC_CH4_TSTMP)

/** \brief 554, Time-Stamp Counter ${i} */
#define EDSADC_CH4_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024554u)
/** Alias (User Manual Name) for EDSADC_CH4_TSCNT.
* To use register names with standard convension, please use EDSADC_CH4_TSCNT.
*/
#define EDSADC_TSCNT4 (EDSADC_CH4_TSCNT)

/** \brief 570, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH4_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024570u)
/** Alias (User Manual Name) for EDSADC_CH4_FCFGA.
* To use register names with standard convension, please use EDSADC_CH4_FCFGA.
*/
#define EDSADC_FCFGA4 (EDSADC_CH4_FCFGA)

/** \brief 578, Boundary Select Register ${i} */
#define EDSADC_CH4_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024578u)
/** Alias (User Manual Name) for EDSADC_CH4_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH4_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL4 (EDSADC_CH4_BOUNDSEL)

/** \brief 580, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH4_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024580u)
/** Alias (User Manual Name) for EDSADC_CH4_RESA.
* To use register names with standard convension, please use EDSADC_CH4_RESA.
*/
#define EDSADC_RESA4 (EDSADC_CH4_RESA)

/** \brief 5A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH4_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00245A0u)
/** Alias (User Manual Name) for EDSADC_CH4_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH4_CGSYNC.
*/
#define EDSADC_CGSYNC4 (EDSADC_CH4_CGSYNC)

/** \brief 5A8, Rectification Configuration Register ${i} */
#define EDSADC_CH4_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00245A8u)
/** Alias (User Manual Name) for EDSADC_CH4_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH4_RECTCFG.
*/
#define EDSADC_RECTCFG4 (EDSADC_CH4_RECTCFG)

/** \brief 5B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH4_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00245B0u)
/** Alias (User Manual Name) for EDSADC_CH4_VCM.
* To use register names with standard convension, please use EDSADC_CH4_VCM.
*/
#define EDSADC_VCM4 (EDSADC_CH4_VCM)

/** \brief 600, Modulator Configuration Register ${i} */
#define EDSADC_CH5_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024600u)
/** Alias (User Manual Name) for EDSADC_CH5_MODCFG.
* To use register names with standard convension, please use EDSADC_CH5_MODCFG.
*/
#define EDSADC_MODCFG5 (EDSADC_CH5_MODCFG)

/** \brief 608, Demodulator Input Config. Register ${i} */
#define EDSADC_CH5_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024608u)
/** Alias (User Manual Name) for EDSADC_CH5_DICFG.
* To use register names with standard convension, please use EDSADC_CH5_DICFG.
*/
#define EDSADC_DICFG5 (EDSADC_CH5_DICFG)

/** \brief 610, Filter Configuration Register ${i}, Main */
#define EDSADC_CH5_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024610u)
/** Alias (User Manual Name) for EDSADC_CH5_FCFGM.
* To use register names with standard convension, please use EDSADC_CH5_FCFGM.
*/
#define EDSADC_FCFGM5 (EDSADC_CH5_FCFGM)

/** \brief 614, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH5_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024614u)
/** Alias (User Manual Name) for EDSADC_CH5_FCFGC.
* To use register names with standard convension, please use EDSADC_CH5_FCFGC.
*/
#define EDSADC_FCFGC5 (EDSADC_CH5_FCFGC)

/** \brief 618, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH5_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024618u)
/** Alias (User Manual Name) for EDSADC_CH5_FCNTC.
* To use register names with standard convension, please use EDSADC_CH5_FCNTC.
*/
#define EDSADC_FCNTC5 (EDSADC_CH5_FCNTC)

/** \brief 620, Integration Window Control Register ${i} */
#define EDSADC_CH5_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024620u)
/** Alias (User Manual Name) for EDSADC_CH5_IWCTR.
* To use register names with standard convension, please use EDSADC_CH5_IWCTR.
*/
#define EDSADC_IWCTR5 (EDSADC_CH5_IWCTR)

/** \brief 624, Intermediate Integration Value */
#define EDSADC_CH5_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024624u)
/** Alias (User Manual Name) for EDSADC_CH5_IIVAL.
* To use register names with standard convension, please use EDSADC_CH5_IIVAL.
*/
#define EDSADC_IIVAL5 (EDSADC_CH5_IIVAL)

/** \brief 628, Integrator Status Register ${i} */
#define EDSADC_CH5_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024628u)
/** Alias (User Manual Name) for EDSADC_CH5_ISTAT.
* To use register names with standard convension, please use EDSADC_CH5_ISTAT.
*/
#define EDSADC_ISTAT5 (EDSADC_CH5_ISTAT)

/** \brief 62C, Result FIFO Control Register ${i} */
#define EDSADC_CH5_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002462Cu)
/** Alias (User Manual Name) for EDSADC_CH5_RFC.
* To use register names with standard convension, please use EDSADC_CH5_RFC.
*/
#define EDSADC_RFC5 (EDSADC_CH5_RFC)

/** \brief 630, Result Register ${i} Main */
#define EDSADC_CH5_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024630u)
/** Alias (User Manual Name) for EDSADC_CH5_RESM.
* To use register names with standard convension, please use EDSADC_CH5_RESM.
*/
#define EDSADC_RESM5 (EDSADC_CH5_RESM)

