Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 638, Offset Compensation Register ${i} */
#define EDSADC_CH5_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024638u)
/** Alias (User Manual Name) for EDSADC_CH5_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH5_OFFCOMP.
*/
#define EDSADC_OFFCOMP5 (EDSADC_CH5_OFFCOMP)

/** \brief 63C, Gain Calibration Register ${i} */
#define EDSADC_CH5_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002463Cu)
/** Alias (User Manual Name) for EDSADC_CH5_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH5_GAINCAL.
*/
#define EDSADC_GAINCAL5 (EDSADC_CH5_GAINCAL)

/** \brief 640, Gain Control Register ${i} */
#define EDSADC_CH5_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024640u)
/** Alias (User Manual Name) for EDSADC_CH5_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH5_GAINCTR.
*/
#define EDSADC_GAINCTR5 (EDSADC_CH5_GAINCTR)

/** \brief 644, Gain Correction Register ${i} */
#define EDSADC_CH5_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024644u)
/** Alias (User Manual Name) for EDSADC_CH5_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH5_GAINCORR.
*/
#define EDSADC_GAINCORR5 (EDSADC_CH5_GAINCORR)

/** \brief 650, Time-Stamp Register ${i} */
#define EDSADC_CH5_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024650u)
/** Alias (User Manual Name) for EDSADC_CH5_TSTMP.
* To use register names with standard convension, please use EDSADC_CH5_TSTMP.
*/
#define EDSADC_TSTMP5 (EDSADC_CH5_TSTMP)

/** \brief 654, Time-Stamp Counter ${i} */
#define EDSADC_CH5_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024654u)
/** Alias (User Manual Name) for EDSADC_CH5_TSCNT.
* To use register names with standard convension, please use EDSADC_CH5_TSCNT.
*/
#define EDSADC_TSCNT5 (EDSADC_CH5_TSCNT)

/** \brief 670, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH5_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024670u)
/** Alias (User Manual Name) for EDSADC_CH5_FCFGA.
* To use register names with standard convension, please use EDSADC_CH5_FCFGA.
*/
#define EDSADC_FCFGA5 (EDSADC_CH5_FCFGA)

/** \brief 678, Boundary Select Register ${i} */
#define EDSADC_CH5_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024678u)
/** Alias (User Manual Name) for EDSADC_CH5_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH5_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL5 (EDSADC_CH5_BOUNDSEL)

/** \brief 680, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH5_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024680u)
/** Alias (User Manual Name) for EDSADC_CH5_RESA.
* To use register names with standard convension, please use EDSADC_CH5_RESA.
*/
#define EDSADC_RESA5 (EDSADC_CH5_RESA)

/** \brief 6A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH5_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00246A0u)
/** Alias (User Manual Name) for EDSADC_CH5_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH5_CGSYNC.
*/
#define EDSADC_CGSYNC5 (EDSADC_CH5_CGSYNC)

/** \brief 6A8, Rectification Configuration Register ${i} */
#define EDSADC_CH5_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00246A8u)
/** Alias (User Manual Name) for EDSADC_CH5_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH5_RECTCFG.
*/
#define EDSADC_RECTCFG5 (EDSADC_CH5_RECTCFG)

/** \brief 6B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH5_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00246B0u)
/** Alias (User Manual Name) for EDSADC_CH5_VCM.
* To use register names with standard convension, please use EDSADC_CH5_VCM.
*/
#define EDSADC_VCM5 (EDSADC_CH5_VCM)

/** \brief 700, Modulator Configuration Register ${i} */
#define EDSADC_CH6_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024700u)
/** Alias (User Manual Name) for EDSADC_CH6_MODCFG.
* To use register names with standard convension, please use EDSADC_CH6_MODCFG.
*/
#define EDSADC_MODCFG6 (EDSADC_CH6_MODCFG)

/** \brief 708, Demodulator Input Config. Register ${i} */
#define EDSADC_CH6_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024708u)
/** Alias (User Manual Name) for EDSADC_CH6_DICFG.
* To use register names with standard convension, please use EDSADC_CH6_DICFG.
*/
#define EDSADC_DICFG6 (EDSADC_CH6_DICFG)

/** \brief 710, Filter Configuration Register ${i}, Main */
#define EDSADC_CH6_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024710u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGM.
* To use register names with standard convension, please use EDSADC_CH6_FCFGM.
*/
#define EDSADC_FCFGM6 (EDSADC_CH6_FCFGM)

/** \brief 714, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH6_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024714u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGC.
* To use register names with standard convension, please use EDSADC_CH6_FCFGC.
*/
#define EDSADC_FCFGC6 (EDSADC_CH6_FCFGC)

/** \brief 718, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH6_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024718u)
/** Alias (User Manual Name) for EDSADC_CH6_FCNTC.
* To use register names with standard convension, please use EDSADC_CH6_FCNTC.
*/
#define EDSADC_FCNTC6 (EDSADC_CH6_FCNTC)

/** \brief 720, Integration Window Control Register ${i} */
#define EDSADC_CH6_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024720u)
/** Alias (User Manual Name) for EDSADC_CH6_IWCTR.
* To use register names with standard convension, please use EDSADC_CH6_IWCTR.
*/
#define EDSADC_IWCTR6 (EDSADC_CH6_IWCTR)

/** \brief 724, Intermediate Integration Value */
#define EDSADC_CH6_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024724u)
/** Alias (User Manual Name) for EDSADC_CH6_IIVAL.
* To use register names with standard convension, please use EDSADC_CH6_IIVAL.
*/
#define EDSADC_IIVAL6 (EDSADC_CH6_IIVAL)

/** \brief 728, Integrator Status Register ${i} */
#define EDSADC_CH6_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024728u)
/** Alias (User Manual Name) for EDSADC_CH6_ISTAT.
* To use register names with standard convension, please use EDSADC_CH6_ISTAT.
*/
#define EDSADC_ISTAT6 (EDSADC_CH6_ISTAT)

