Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 72C, Result FIFO Control Register ${i} */
#define EDSADC_CH6_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002472Cu)
/** Alias (User Manual Name) for EDSADC_CH6_RFC.
* To use register names with standard convension, please use EDSADC_CH6_RFC.
*/
#define EDSADC_RFC6 (EDSADC_CH6_RFC)

/** \brief 730, Result Register ${i} Main */
#define EDSADC_CH6_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024730u)
/** Alias (User Manual Name) for EDSADC_CH6_RESM.
* To use register names with standard convension, please use EDSADC_CH6_RESM.
*/
#define EDSADC_RESM6 (EDSADC_CH6_RESM)

/** \brief 738, Offset Compensation Register ${i} */
#define EDSADC_CH6_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024738u)
/** Alias (User Manual Name) for EDSADC_CH6_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH6_OFFCOMP.
*/
#define EDSADC_OFFCOMP6 (EDSADC_CH6_OFFCOMP)

/** \brief 73C, Gain Calibration Register ${i} */
#define EDSADC_CH6_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002473Cu)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH6_GAINCAL.
*/
#define EDSADC_GAINCAL6 (EDSADC_CH6_GAINCAL)

/** \brief 740, Gain Control Register ${i} */
#define EDSADC_CH6_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024740u)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH6_GAINCTR.
*/
#define EDSADC_GAINCTR6 (EDSADC_CH6_GAINCTR)

/** \brief 744, Gain Correction Register ${i} */
#define EDSADC_CH6_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024744u)
/** Alias (User Manual Name) for EDSADC_CH6_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH6_GAINCORR.
*/
#define EDSADC_GAINCORR6 (EDSADC_CH6_GAINCORR)

/** \brief 750, Time-Stamp Register ${i} */
#define EDSADC_CH6_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024750u)
/** Alias (User Manual Name) for EDSADC_CH6_TSTMP.
* To use register names with standard convension, please use EDSADC_CH6_TSTMP.
*/
#define EDSADC_TSTMP6 (EDSADC_CH6_TSTMP)

/** \brief 754, Time-Stamp Counter ${i} */
#define EDSADC_CH6_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024754u)
/** Alias (User Manual Name) for EDSADC_CH6_TSCNT.
* To use register names with standard convension, please use EDSADC_CH6_TSCNT.
*/
#define EDSADC_TSCNT6 (EDSADC_CH6_TSCNT)

/** \brief 770, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH6_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024770u)
/** Alias (User Manual Name) for EDSADC_CH6_FCFGA.
* To use register names with standard convension, please use EDSADC_CH6_FCFGA.
*/
#define EDSADC_FCFGA6 (EDSADC_CH6_FCFGA)

/** \brief 778, Boundary Select Register ${i} */
#define EDSADC_CH6_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024778u)
/** Alias (User Manual Name) for EDSADC_CH6_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH6_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL6 (EDSADC_CH6_BOUNDSEL)

/** \brief 780, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH6_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024780u)
/** Alias (User Manual Name) for EDSADC_CH6_RESA.
* To use register names with standard convension, please use EDSADC_CH6_RESA.
*/
#define EDSADC_RESA6 (EDSADC_CH6_RESA)

/** \brief 7A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH6_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00247A0u)
/** Alias (User Manual Name) for EDSADC_CH6_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH6_CGSYNC.
*/
#define EDSADC_CGSYNC6 (EDSADC_CH6_CGSYNC)

/** \brief 7A8, Rectification Configuration Register ${i} */
#define EDSADC_CH6_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00247A8u)
/** Alias (User Manual Name) for EDSADC_CH6_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH6_RECTCFG.
*/
#define EDSADC_RECTCFG6 (EDSADC_CH6_RECTCFG)

/** \brief 7B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH6_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00247B0u)
/** Alias (User Manual Name) for EDSADC_CH6_VCM.
* To use register names with standard convension, please use EDSADC_CH6_VCM.
*/
#define EDSADC_VCM6 (EDSADC_CH6_VCM)

/** \brief 800, Modulator Configuration Register ${i} */
#define EDSADC_CH7_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024800u)
/** Alias (User Manual Name) for EDSADC_CH7_MODCFG.
* To use register names with standard convension, please use EDSADC_CH7_MODCFG.
*/
#define EDSADC_MODCFG7 (EDSADC_CH7_MODCFG)

/** \brief 808, Demodulator Input Config. Register ${i} */
#define EDSADC_CH7_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024808u)
/** Alias (User Manual Name) for EDSADC_CH7_DICFG.
* To use register names with standard convension, please use EDSADC_CH7_DICFG.
*/
#define EDSADC_DICFG7 (EDSADC_CH7_DICFG)

/** \brief 810, Filter Configuration Register ${i}, Main */
#define EDSADC_CH7_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024810u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGM.
* To use register names with standard convension, please use EDSADC_CH7_FCFGM.
*/
#define EDSADC_FCFGM7 (EDSADC_CH7_FCFGM)

/** \brief 814, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH7_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024814u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGC.
* To use register names with standard convension, please use EDSADC_CH7_FCFGC.
*/
#define EDSADC_FCFGC7 (EDSADC_CH7_FCFGC)

/** \brief 818, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH7_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024818u)
/** Alias (User Manual Name) for EDSADC_CH7_FCNTC.
* To use register names with standard convension, please use EDSADC_CH7_FCNTC.
*/
#define EDSADC_FCNTC7 (EDSADC_CH7_FCNTC)

/** \brief 820, Integration Window Control Register ${i} */
#define EDSADC_CH7_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024820u)
/** Alias (User Manual Name) for EDSADC_CH7_IWCTR.
* To use register names with standard convension, please use EDSADC_CH7_IWCTR.
*/
#define EDSADC_IWCTR7 (EDSADC_CH7_IWCTR)

/** \brief 824, Intermediate Integration Value */
#define EDSADC_CH7_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024824u)
/** Alias (User Manual Name) for EDSADC_CH7_IIVAL.
* To use register names with standard convension, please use EDSADC_CH7_IIVAL.
*/
#define EDSADC_IIVAL7 (EDSADC_CH7_IIVAL)

/** \brief 828, Integrator Status Register ${i} */
#define EDSADC_CH7_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024828u)
/** Alias (User Manual Name) for EDSADC_CH7_ISTAT.
* To use register names with standard convension, please use EDSADC_CH7_ISTAT.
*/
#define EDSADC_ISTAT7 (EDSADC_CH7_ISTAT)

