Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief 82C, Result FIFO Control Register ${i} */
#define EDSADC_CH7_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002482Cu)
/** Alias (User Manual Name) for EDSADC_CH7_RFC.
* To use register names with standard convension, please use EDSADC_CH7_RFC.
*/
#define EDSADC_RFC7 (EDSADC_CH7_RFC)

/** \brief 830, Result Register ${i} Main */
#define EDSADC_CH7_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024830u)
/** Alias (User Manual Name) for EDSADC_CH7_RESM.
* To use register names with standard convension, please use EDSADC_CH7_RESM.
*/
#define EDSADC_RESM7 (EDSADC_CH7_RESM)

/** \brief 838, Offset Compensation Register ${i} */
#define EDSADC_CH7_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024838u)
/** Alias (User Manual Name) for EDSADC_CH7_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH7_OFFCOMP.
*/
#define EDSADC_OFFCOMP7 (EDSADC_CH7_OFFCOMP)

/** \brief 83C, Gain Calibration Register ${i} */
#define EDSADC_CH7_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002483Cu)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH7_GAINCAL.
*/
#define EDSADC_GAINCAL7 (EDSADC_CH7_GAINCAL)

/** \brief 840, Gain Control Register ${i} */
#define EDSADC_CH7_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024840u)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH7_GAINCTR.
*/
#define EDSADC_GAINCTR7 (EDSADC_CH7_GAINCTR)

/** \brief 844, Gain Correction Register ${i} */
#define EDSADC_CH7_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024844u)
/** Alias (User Manual Name) for EDSADC_CH7_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH7_GAINCORR.
*/
#define EDSADC_GAINCORR7 (EDSADC_CH7_GAINCORR)

/** \brief 850, Time-Stamp Register ${i} */
#define EDSADC_CH7_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024850u)
/** Alias (User Manual Name) for EDSADC_CH7_TSTMP.
* To use register names with standard convension, please use EDSADC_CH7_TSTMP.
*/
#define EDSADC_TSTMP7 (EDSADC_CH7_TSTMP)

/** \brief 854, Time-Stamp Counter ${i} */
#define EDSADC_CH7_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024854u)
/** Alias (User Manual Name) for EDSADC_CH7_TSCNT.
* To use register names with standard convension, please use EDSADC_CH7_TSCNT.
*/
#define EDSADC_TSCNT7 (EDSADC_CH7_TSCNT)

/** \brief 870, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH7_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024870u)
/** Alias (User Manual Name) for EDSADC_CH7_FCFGA.
* To use register names with standard convension, please use EDSADC_CH7_FCFGA.
*/
#define EDSADC_FCFGA7 (EDSADC_CH7_FCFGA)

/** \brief 878, Boundary Select Register ${i} */
#define EDSADC_CH7_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024878u)
/** Alias (User Manual Name) for EDSADC_CH7_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH7_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL7 (EDSADC_CH7_BOUNDSEL)

/** \brief 880, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH7_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024880u)
/** Alias (User Manual Name) for EDSADC_CH7_RESA.
* To use register names with standard convension, please use EDSADC_CH7_RESA.
*/
#define EDSADC_RESA7 (EDSADC_CH7_RESA)

/** \brief 8A0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH7_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00248A0u)
/** Alias (User Manual Name) for EDSADC_CH7_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH7_CGSYNC.
*/
#define EDSADC_CGSYNC7 (EDSADC_CH7_CGSYNC)

/** \brief 8A8, Rectification Configuration Register ${i} */
#define EDSADC_CH7_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00248A8u)
/** Alias (User Manual Name) for EDSADC_CH7_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH7_RECTCFG.
*/
#define EDSADC_RECTCFG7 (EDSADC_CH7_RECTCFG)

/** \brief 8B0, Common Mode Voltage Register ${i} */
#define EDSADC_CH7_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00248B0u)
/** Alias (User Manual Name) for EDSADC_CH7_VCM.
* To use register names with standard convension, please use EDSADC_CH7_VCM.
*/
#define EDSADC_VCM7 (EDSADC_CH7_VCM)

/** \brief 900, Modulator Configuration Register ${i} */
#define EDSADC_CH8_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024900u)
/** Alias (User Manual Name) for EDSADC_CH8_MODCFG.
* To use register names with standard convension, please use EDSADC_CH8_MODCFG.
*/
#define EDSADC_MODCFG8 (EDSADC_CH8_MODCFG)

/** \brief 908, Demodulator Input Config. Register ${i} */
#define EDSADC_CH8_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024908u)
/** Alias (User Manual Name) for EDSADC_CH8_DICFG.
* To use register names with standard convension, please use EDSADC_CH8_DICFG.
*/
#define EDSADC_DICFG8 (EDSADC_CH8_DICFG)

/** \brief 910, Filter Configuration Register ${i}, Main */
#define EDSADC_CH8_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024910u)
/** Alias (User Manual Name) for EDSADC_CH8_FCFGM.
* To use register names with standard convension, please use EDSADC_CH8_FCFGM.
*/
#define EDSADC_FCFGM8 (EDSADC_CH8_FCFGM)

/** \brief 914, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH8_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024914u)
/** Alias (User Manual Name) for EDSADC_CH8_FCFGC.
* To use register names with standard convension, please use EDSADC_CH8_FCFGC.
*/
#define EDSADC_FCFGC8 (EDSADC_CH8_FCFGC)

/** \brief 918, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH8_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024918u)
/** Alias (User Manual Name) for EDSADC_CH8_FCNTC.
* To use register names with standard convension, please use EDSADC_CH8_FCNTC.
*/
#define EDSADC_FCNTC8 (EDSADC_CH8_FCNTC)

/** \brief 920, Integration Window Control Register ${i} */
#define EDSADC_CH8_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024920u)
/** Alias (User Manual Name) for EDSADC_CH8_IWCTR.
* To use register names with standard convension, please use EDSADC_CH8_IWCTR.
*/
#define EDSADC_IWCTR8 (EDSADC_CH8_IWCTR)

/** \brief 924, Intermediate Integration Value */
#define EDSADC_CH8_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024924u)
/** Alias (User Manual Name) for EDSADC_CH8_IIVAL.
* To use register names with standard convension, please use EDSADC_CH8_IIVAL.
*/
#define EDSADC_IIVAL8 (EDSADC_CH8_IIVAL)

/** \brief 928, Integrator Status Register ${i} */
#define EDSADC_CH8_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024928u)
/** Alias (User Manual Name) for EDSADC_CH8_ISTAT.
* To use register names with standard convension, please use EDSADC_CH8_ISTAT.
*/
#define EDSADC_ISTAT8 (EDSADC_CH8_ISTAT)

/** \brief 92C, Result FIFO Control Register ${i} */
#define EDSADC_CH8_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002492Cu)
/** Alias (User Manual Name) for EDSADC_CH8_RFC.
* To use register names with standard convension, please use EDSADC_CH8_RFC.
*/
#define EDSADC_RFC8 (EDSADC_CH8_RFC)

/** \brief 930, Result Register ${i} Main */
#define EDSADC_CH8_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024930u)
/** Alias (User Manual Name) for EDSADC_CH8_RESM.
* To use register names with standard convension, please use EDSADC_CH8_RESM.
*/
#define EDSADC_RESM8 (EDSADC_CH8_RESM)

