Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief A2C, Result FIFO Control Register ${i} */
#define EDSADC_CH9_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024A2Cu)
/** Alias (User Manual Name) for EDSADC_CH9_RFC.
* To use register names with standard convension, please use EDSADC_CH9_RFC.
*/
#define EDSADC_RFC9 (EDSADC_CH9_RFC)

/** \brief A30, Result Register ${i} Main */
#define EDSADC_CH9_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024A30u)
/** Alias (User Manual Name) for EDSADC_CH9_RESM.
* To use register names with standard convension, please use EDSADC_CH9_RESM.
*/
#define EDSADC_RESM9 (EDSADC_CH9_RESM)

/** \brief A38, Offset Compensation Register ${i} */
#define EDSADC_CH9_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024A38u)
/** Alias (User Manual Name) for EDSADC_CH9_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH9_OFFCOMP.
*/
#define EDSADC_OFFCOMP9 (EDSADC_CH9_OFFCOMP)

/** \brief A3C, Gain Calibration Register ${i} */
#define EDSADC_CH9_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024A3Cu)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH9_GAINCAL.
*/
#define EDSADC_GAINCAL9 (EDSADC_CH9_GAINCAL)

/** \brief A40, Gain Control Register ${i} */
#define EDSADC_CH9_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024A40u)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH9_GAINCTR.
*/
#define EDSADC_GAINCTR9 (EDSADC_CH9_GAINCTR)

/** \brief A44, Gain Correction Register ${i} */
#define EDSADC_CH9_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024A44u)
/** Alias (User Manual Name) for EDSADC_CH9_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH9_GAINCORR.
*/
#define EDSADC_GAINCORR9 (EDSADC_CH9_GAINCORR)

/** \brief A50, Time-Stamp Register ${i} */
#define EDSADC_CH9_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024A50u)
/** Alias (User Manual Name) for EDSADC_CH9_TSTMP.
* To use register names with standard convension, please use EDSADC_CH9_TSTMP.
*/
#define EDSADC_TSTMP9 (EDSADC_CH9_TSTMP)

/** \brief A54, Time-Stamp Counter ${i} */
#define EDSADC_CH9_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024A54u)
/** Alias (User Manual Name) for EDSADC_CH9_TSCNT.
* To use register names with standard convension, please use EDSADC_CH9_TSCNT.
*/
#define EDSADC_TSCNT9 (EDSADC_CH9_TSCNT)

/** \brief A70, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH9_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024A70u)
/** Alias (User Manual Name) for EDSADC_CH9_FCFGA.
* To use register names with standard convension, please use EDSADC_CH9_FCFGA.
*/
#define EDSADC_FCFGA9 (EDSADC_CH9_FCFGA)

/** \brief A78, Boundary Select Register ${i} */
#define EDSADC_CH9_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024A78u)
/** Alias (User Manual Name) for EDSADC_CH9_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH9_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL9 (EDSADC_CH9_BOUNDSEL)

/** \brief A80, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH9_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024A80u)
/** Alias (User Manual Name) for EDSADC_CH9_RESA.
* To use register names with standard convension, please use EDSADC_CH9_RESA.
*/
#define EDSADC_RESA9 (EDSADC_CH9_RESA)

/** \brief AA0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH9_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024AA0u)
/** Alias (User Manual Name) for EDSADC_CH9_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH9_CGSYNC.
*/
#define EDSADC_CGSYNC9 (EDSADC_CH9_CGSYNC)

/** \brief AA8, Rectification Configuration Register ${i} */
#define EDSADC_CH9_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024AA8u)
/** Alias (User Manual Name) for EDSADC_CH9_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH9_RECTCFG.
*/
#define EDSADC_RECTCFG9 (EDSADC_CH9_RECTCFG)

/** \brief AB0, Common Mode Voltage Register ${i} */
#define EDSADC_CH9_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024AB0u)
/** Alias (User Manual Name) for EDSADC_CH9_VCM.
* To use register names with standard convension, please use EDSADC_CH9_VCM.
*/
#define EDSADC_VCM9 (EDSADC_CH9_VCM)

/** \brief B00, Modulator Configuration Register ${i} */
#define EDSADC_CH10_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024B00u)
/** Alias (User Manual Name) for EDSADC_CH10_MODCFG.
* To use register names with standard convension, please use EDSADC_CH10_MODCFG.
*/
#define EDSADC_MODCFG10 (EDSADC_CH10_MODCFG)

/** \brief B08, Demodulator Input Config. Register ${i} */
#define EDSADC_CH10_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024B08u)
/** Alias (User Manual Name) for EDSADC_CH10_DICFG.
* To use register names with standard convension, please use EDSADC_CH10_DICFG.
*/
#define EDSADC_DICFG10 (EDSADC_CH10_DICFG)

/** \brief B10, Filter Configuration Register ${i}, Main */
#define EDSADC_CH10_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024B10u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGM.
* To use register names with standard convension, please use EDSADC_CH10_FCFGM.
*/
#define EDSADC_FCFGM10 (EDSADC_CH10_FCFGM)

/** \brief B14, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH10_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024B14u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGC.
* To use register names with standard convension, please use EDSADC_CH10_FCFGC.
*/
#define EDSADC_FCFGC10 (EDSADC_CH10_FCFGC)

/** \brief B18, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH10_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024B18u)
/** Alias (User Manual Name) for EDSADC_CH10_FCNTC.
* To use register names with standard convension, please use EDSADC_CH10_FCNTC.
*/
#define EDSADC_FCNTC10 (EDSADC_CH10_FCNTC)

/** \brief B20, Integration Window Control Register ${i} */
#define EDSADC_CH10_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024B20u)
/** Alias (User Manual Name) for EDSADC_CH10_IWCTR.
* To use register names with standard convension, please use EDSADC_CH10_IWCTR.
*/
#define EDSADC_IWCTR10 (EDSADC_CH10_IWCTR)

/** \brief B24, Intermediate Integration Value */
#define EDSADC_CH10_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024B24u)
/** Alias (User Manual Name) for EDSADC_CH10_IIVAL.
* To use register names with standard convension, please use EDSADC_CH10_IIVAL.
*/
#define EDSADC_IIVAL10 (EDSADC_CH10_IIVAL)

