Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief B28, Integrator Status Register ${i} */
#define EDSADC_CH10_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024B28u)
/** Alias (User Manual Name) for EDSADC_CH10_ISTAT.
* To use register names with standard convension, please use EDSADC_CH10_ISTAT.
*/
#define EDSADC_ISTAT10 (EDSADC_CH10_ISTAT)

/** \brief B2C, Result FIFO Control Register ${i} */
#define EDSADC_CH10_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024B2Cu)
/** Alias (User Manual Name) for EDSADC_CH10_RFC.
* To use register names with standard convension, please use EDSADC_CH10_RFC.
*/
#define EDSADC_RFC10 (EDSADC_CH10_RFC)

/** \brief B30, Result Register ${i} Main */
#define EDSADC_CH10_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024B30u)
/** Alias (User Manual Name) for EDSADC_CH10_RESM.
* To use register names with standard convension, please use EDSADC_CH10_RESM.
*/
#define EDSADC_RESM10 (EDSADC_CH10_RESM)

/** \brief B38, Offset Compensation Register ${i} */
#define EDSADC_CH10_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024B38u)
/** Alias (User Manual Name) for EDSADC_CH10_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH10_OFFCOMP.
*/
#define EDSADC_OFFCOMP10 (EDSADC_CH10_OFFCOMP)

/** \brief B3C, Gain Calibration Register ${i} */
#define EDSADC_CH10_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024B3Cu)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH10_GAINCAL.
*/
#define EDSADC_GAINCAL10 (EDSADC_CH10_GAINCAL)

/** \brief B40, Gain Control Register ${i} */
#define EDSADC_CH10_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024B40u)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH10_GAINCTR.
*/
#define EDSADC_GAINCTR10 (EDSADC_CH10_GAINCTR)

/** \brief B44, Gain Correction Register ${i} */
#define EDSADC_CH10_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024B44u)
/** Alias (User Manual Name) for EDSADC_CH10_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH10_GAINCORR.
*/
#define EDSADC_GAINCORR10 (EDSADC_CH10_GAINCORR)

/** \brief B50, Time-Stamp Register ${i} */
#define EDSADC_CH10_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024B50u)
/** Alias (User Manual Name) for EDSADC_CH10_TSTMP.
* To use register names with standard convension, please use EDSADC_CH10_TSTMP.
*/
#define EDSADC_TSTMP10 (EDSADC_CH10_TSTMP)

/** \brief B54, Time-Stamp Counter ${i} */
#define EDSADC_CH10_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024B54u)
/** Alias (User Manual Name) for EDSADC_CH10_TSCNT.
* To use register names with standard convension, please use EDSADC_CH10_TSCNT.
*/
#define EDSADC_TSCNT10 (EDSADC_CH10_TSCNT)

/** \brief B70, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH10_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024B70u)
/** Alias (User Manual Name) for EDSADC_CH10_FCFGA.
* To use register names with standard convension, please use EDSADC_CH10_FCFGA.
*/
#define EDSADC_FCFGA10 (EDSADC_CH10_FCFGA)

/** \brief B78, Boundary Select Register ${i} */
#define EDSADC_CH10_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024B78u)
/** Alias (User Manual Name) for EDSADC_CH10_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH10_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL10 (EDSADC_CH10_BOUNDSEL)

/** \brief B80, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH10_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024B80u)
/** Alias (User Manual Name) for EDSADC_CH10_RESA.
* To use register names with standard convension, please use EDSADC_CH10_RESA.
*/
#define EDSADC_RESA10 (EDSADC_CH10_RESA)

/** \brief BA0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH10_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024BA0u)
/** Alias (User Manual Name) for EDSADC_CH10_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH10_CGSYNC.
*/
#define EDSADC_CGSYNC10 (EDSADC_CH10_CGSYNC)

/** \brief BA8, Rectification Configuration Register ${i} */
#define EDSADC_CH10_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024BA8u)
/** Alias (User Manual Name) for EDSADC_CH10_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH10_RECTCFG.
*/
#define EDSADC_RECTCFG10 (EDSADC_CH10_RECTCFG)

/** \brief BB0, Common Mode Voltage Register ${i} */
#define EDSADC_CH10_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024BB0u)
/** Alias (User Manual Name) for EDSADC_CH10_VCM.
* To use register names with standard convension, please use EDSADC_CH10_VCM.
*/
#define EDSADC_VCM10 (EDSADC_CH10_VCM)

/** \brief C00, Modulator Configuration Register ${i} */
#define EDSADC_CH11_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024C00u)
/** Alias (User Manual Name) for EDSADC_CH11_MODCFG.
* To use register names with standard convension, please use EDSADC_CH11_MODCFG.
*/
#define EDSADC_MODCFG11 (EDSADC_CH11_MODCFG)

/** \brief C08, Demodulator Input Config. Register ${i} */
#define EDSADC_CH11_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024C08u)
/** Alias (User Manual Name) for EDSADC_CH11_DICFG.
* To use register names with standard convension, please use EDSADC_CH11_DICFG.
*/
#define EDSADC_DICFG11 (EDSADC_CH11_DICFG)

/** \brief C10, Filter Configuration Register ${i}, Main */
#define EDSADC_CH11_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024C10u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGM.
* To use register names with standard convension, please use EDSADC_CH11_FCFGM.
*/
#define EDSADC_FCFGM11 (EDSADC_CH11_FCFGM)

/** \brief C14, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH11_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024C14u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGC.
* To use register names with standard convension, please use EDSADC_CH11_FCFGC.
*/
#define EDSADC_FCFGC11 (EDSADC_CH11_FCFGC)

/** \brief C18, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH11_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024C18u)
/** Alias (User Manual Name) for EDSADC_CH11_FCNTC.
* To use register names with standard convension, please use EDSADC_CH11_FCNTC.
*/
#define EDSADC_FCNTC11 (EDSADC_CH11_FCNTC)

/** \brief C20, Integration Window Control Register ${i} */
#define EDSADC_CH11_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024C20u)
/** Alias (User Manual Name) for EDSADC_CH11_IWCTR.
* To use register names with standard convension, please use EDSADC_CH11_IWCTR.
*/
#define EDSADC_IWCTR11 (EDSADC_CH11_IWCTR)

/** \brief C24, Intermediate Integration Value */
#define EDSADC_CH11_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024C24u)
/** Alias (User Manual Name) for EDSADC_CH11_IIVAL.
* To use register names with standard convension, please use EDSADC_CH11_IIVAL.
*/
#define EDSADC_IIVAL11 (EDSADC_CH11_IIVAL)

/** \brief C28, Integrator Status Register ${i} */
#define EDSADC_CH11_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024C28u)
/** Alias (User Manual Name) for EDSADC_CH11_ISTAT.
* To use register names with standard convension, please use EDSADC_CH11_ISTAT.
*/
#define EDSADC_ISTAT11 (EDSADC_CH11_ISTAT)

/** \brief C2C, Result FIFO Control Register ${i} */
#define EDSADC_CH11_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024C2Cu)
/** Alias (User Manual Name) for EDSADC_CH11_RFC.
* To use register names with standard convension, please use EDSADC_CH11_RFC.
*/
#define EDSADC_RFC11 (EDSADC_CH11_RFC)

/** \brief C30, Result Register ${i} Main */
#define EDSADC_CH11_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024C30u)
/** Alias (User Manual Name) for EDSADC_CH11_RESM.
* To use register names with standard convension, please use EDSADC_CH11_RESM.
*/
#define EDSADC_RESM11 (EDSADC_CH11_RESM)

/** \brief C38, Offset Compensation Register ${i} */
#define EDSADC_CH11_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024C38u)
/** Alias (User Manual Name) for EDSADC_CH11_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH11_OFFCOMP.
*/
#define EDSADC_OFFCOMP11 (EDSADC_CH11_OFFCOMP)

/** \brief C3C, Gain Calibration Register ${i} */
#define EDSADC_CH11_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024C3Cu)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH11_GAINCAL.
*/
#define EDSADC_GAINCAL11 (EDSADC_CH11_GAINCAL)

/** \brief C40, Gain Control Register ${i} */
#define EDSADC_CH11_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024C40u)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH11_GAINCTR.
*/
#define EDSADC_GAINCTR11 (EDSADC_CH11_GAINCTR)

