Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief C44, Gain Correction Register ${i} */
#define EDSADC_CH11_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024C44u)
/** Alias (User Manual Name) for EDSADC_CH11_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH11_GAINCORR.
*/
#define EDSADC_GAINCORR11 (EDSADC_CH11_GAINCORR)

/** \brief C50, Time-Stamp Register ${i} */
#define EDSADC_CH11_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024C50u)
/** Alias (User Manual Name) for EDSADC_CH11_TSTMP.
* To use register names with standard convension, please use EDSADC_CH11_TSTMP.
*/
#define EDSADC_TSTMP11 (EDSADC_CH11_TSTMP)

/** \brief C54, Time-Stamp Counter ${i} */
#define EDSADC_CH11_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024C54u)
/** Alias (User Manual Name) for EDSADC_CH11_TSCNT.
* To use register names with standard convension, please use EDSADC_CH11_TSCNT.
*/
#define EDSADC_TSCNT11 (EDSADC_CH11_TSCNT)

/** \brief C70, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH11_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024C70u)
/** Alias (User Manual Name) for EDSADC_CH11_FCFGA.
* To use register names with standard convension, please use EDSADC_CH11_FCFGA.
*/
#define EDSADC_FCFGA11 (EDSADC_CH11_FCFGA)

/** \brief C78, Boundary Select Register ${i} */
#define EDSADC_CH11_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024C78u)
/** Alias (User Manual Name) for EDSADC_CH11_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH11_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL11 (EDSADC_CH11_BOUNDSEL)

/** \brief C80, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH11_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024C80u)
/** Alias (User Manual Name) for EDSADC_CH11_RESA.
* To use register names with standard convension, please use EDSADC_CH11_RESA.
*/
#define EDSADC_RESA11 (EDSADC_CH11_RESA)

/** \brief CA0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH11_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024CA0u)
/** Alias (User Manual Name) for EDSADC_CH11_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH11_CGSYNC.
*/
#define EDSADC_CGSYNC11 (EDSADC_CH11_CGSYNC)

/** \brief CA8, Rectification Configuration Register ${i} */
#define EDSADC_CH11_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024CA8u)
/** Alias (User Manual Name) for EDSADC_CH11_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH11_RECTCFG.
*/
#define EDSADC_RECTCFG11 (EDSADC_CH11_RECTCFG)

/** \brief CB0, Common Mode Voltage Register ${i} */
#define EDSADC_CH11_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024CB0u)
/** Alias (User Manual Name) for EDSADC_CH11_VCM.
* To use register names with standard convension, please use EDSADC_CH11_VCM.
*/
#define EDSADC_VCM11 (EDSADC_CH11_VCM)

/** \brief D00, Modulator Configuration Register ${i} */
#define EDSADC_CH12_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024D00u)
/** Alias (User Manual Name) for EDSADC_CH12_MODCFG.
* To use register names with standard convension, please use EDSADC_CH12_MODCFG.
*/
#define EDSADC_MODCFG12 (EDSADC_CH12_MODCFG)

/** \brief D08, Demodulator Input Config. Register ${i} */
#define EDSADC_CH12_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024D08u)
/** Alias (User Manual Name) for EDSADC_CH12_DICFG.
* To use register names with standard convension, please use EDSADC_CH12_DICFG.
*/
#define EDSADC_DICFG12 (EDSADC_CH12_DICFG)

/** \brief D10, Filter Configuration Register ${i}, Main */
#define EDSADC_CH12_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024D10u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGM.
* To use register names with standard convension, please use EDSADC_CH12_FCFGM.
*/
#define EDSADC_FCFGM12 (EDSADC_CH12_FCFGM)

/** \brief D14, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH12_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024D14u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGC.
* To use register names with standard convension, please use EDSADC_CH12_FCFGC.
*/
#define EDSADC_FCFGC12 (EDSADC_CH12_FCFGC)

/** \brief D18, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH12_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024D18u)
/** Alias (User Manual Name) for EDSADC_CH12_FCNTC.
* To use register names with standard convension, please use EDSADC_CH12_FCNTC.
*/
#define EDSADC_FCNTC12 (EDSADC_CH12_FCNTC)

/** \brief D20, Integration Window Control Register ${i} */
#define EDSADC_CH12_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024D20u)
/** Alias (User Manual Name) for EDSADC_CH12_IWCTR.
* To use register names with standard convension, please use EDSADC_CH12_IWCTR.
*/
#define EDSADC_IWCTR12 (EDSADC_CH12_IWCTR)

/** \brief D24, Intermediate Integration Value */
#define EDSADC_CH12_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024D24u)
/** Alias (User Manual Name) for EDSADC_CH12_IIVAL.
* To use register names with standard convension, please use EDSADC_CH12_IIVAL.
*/
#define EDSADC_IIVAL12 (EDSADC_CH12_IIVAL)

/** \brief D28, Integrator Status Register ${i} */
#define EDSADC_CH12_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024D28u)
/** Alias (User Manual Name) for EDSADC_CH12_ISTAT.
* To use register names with standard convension, please use EDSADC_CH12_ISTAT.
*/
#define EDSADC_ISTAT12 (EDSADC_CH12_ISTAT)

/** \brief D2C, Result FIFO Control Register ${i} */
#define EDSADC_CH12_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024D2Cu)
/** Alias (User Manual Name) for EDSADC_CH12_RFC.
* To use register names with standard convension, please use EDSADC_CH12_RFC.
*/
#define EDSADC_RFC12 (EDSADC_CH12_RFC)

/** \brief D30, Result Register ${i} Main */
#define EDSADC_CH12_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024D30u)
/** Alias (User Manual Name) for EDSADC_CH12_RESM.
* To use register names with standard convension, please use EDSADC_CH12_RESM.
*/
#define EDSADC_RESM12 (EDSADC_CH12_RESM)

/** \brief D38, Offset Compensation Register ${i} */
#define EDSADC_CH12_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024D38u)
/** Alias (User Manual Name) for EDSADC_CH12_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH12_OFFCOMP.
*/
#define EDSADC_OFFCOMP12 (EDSADC_CH12_OFFCOMP)

/** \brief D3C, Gain Calibration Register ${i} */
#define EDSADC_CH12_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024D3Cu)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH12_GAINCAL.
*/
#define EDSADC_GAINCAL12 (EDSADC_CH12_GAINCAL)

/** \brief D40, Gain Control Register ${i} */
#define EDSADC_CH12_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024D40u)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH12_GAINCTR.
*/
#define EDSADC_GAINCTR12 (EDSADC_CH12_GAINCTR)

/** \brief D44, Gain Correction Register ${i} */
#define EDSADC_CH12_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024D44u)
/** Alias (User Manual Name) for EDSADC_CH12_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH12_GAINCORR.
*/
#define EDSADC_GAINCORR12 (EDSADC_CH12_GAINCORR)

/** \brief D50, Time-Stamp Register ${i} */
#define EDSADC_CH12_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024D50u)
/** Alias (User Manual Name) for EDSADC_CH12_TSTMP.
* To use register names with standard convension, please use EDSADC_CH12_TSTMP.
*/
#define EDSADC_TSTMP12 (EDSADC_CH12_TSTMP)

