Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief D54, Time-Stamp Counter ${i} */
#define EDSADC_CH12_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024D54u)
/** Alias (User Manual Name) for EDSADC_CH12_TSCNT.
* To use register names with standard convension, please use EDSADC_CH12_TSCNT.
*/
#define EDSADC_TSCNT12 (EDSADC_CH12_TSCNT)

/** \brief D70, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH12_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024D70u)
/** Alias (User Manual Name) for EDSADC_CH12_FCFGA.
* To use register names with standard convension, please use EDSADC_CH12_FCFGA.
*/
#define EDSADC_FCFGA12 (EDSADC_CH12_FCFGA)

/** \brief D78, Boundary Select Register ${i} */
#define EDSADC_CH12_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024D78u)
/** Alias (User Manual Name) for EDSADC_CH12_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH12_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL12 (EDSADC_CH12_BOUNDSEL)

/** \brief D80, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH12_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024D80u)
/** Alias (User Manual Name) for EDSADC_CH12_RESA.
* To use register names with standard convension, please use EDSADC_CH12_RESA.
*/
#define EDSADC_RESA12 (EDSADC_CH12_RESA)

/** \brief DA0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH12_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024DA0u)
/** Alias (User Manual Name) for EDSADC_CH12_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH12_CGSYNC.
*/
#define EDSADC_CGSYNC12 (EDSADC_CH12_CGSYNC)

/** \brief DA8, Rectification Configuration Register ${i} */
#define EDSADC_CH12_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024DA8u)
/** Alias (User Manual Name) for EDSADC_CH12_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH12_RECTCFG.
*/
#define EDSADC_RECTCFG12 (EDSADC_CH12_RECTCFG)

/** \brief DB0, Common Mode Voltage Register ${i} */
#define EDSADC_CH12_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024DB0u)
/** Alias (User Manual Name) for EDSADC_CH12_VCM.
* To use register names with standard convension, please use EDSADC_CH12_VCM.
*/
#define EDSADC_VCM12 (EDSADC_CH12_VCM)

/** \brief E00, Modulator Configuration Register ${i} */
#define EDSADC_CH13_MODCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024E00u)
/** Alias (User Manual Name) for EDSADC_CH13_MODCFG.
* To use register names with standard convension, please use EDSADC_CH13_MODCFG.
*/
#define EDSADC_MODCFG13 (EDSADC_CH13_MODCFG)

/** \brief E08, Demodulator Input Config. Register ${i} */
#define EDSADC_CH13_DICFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024E08u)
/** Alias (User Manual Name) for EDSADC_CH13_DICFG.
* To use register names with standard convension, please use EDSADC_CH13_DICFG.
*/
#define EDSADC_DICFG13 (EDSADC_CH13_DICFG)

/** \brief E10, Filter Configuration Register ${i}, Main */
#define EDSADC_CH13_FCFGM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024E10u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGM.
* To use register names with standard convension, please use EDSADC_CH13_FCFGM.
*/
#define EDSADC_FCFGM13 (EDSADC_CH13_FCFGM)

/** \brief E14, Filter Configuration Register ${i}, CIC Filter */
#define EDSADC_CH13_FCFGC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024E14u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGC.
* To use register names with standard convension, please use EDSADC_CH13_FCFGC.
*/
#define EDSADC_FCFGC13 (EDSADC_CH13_FCFGC)

/** \brief E18, Filter Counter Register ${i}, CIC Filter */
#define EDSADC_CH13_FCNTC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024E18u)
/** Alias (User Manual Name) for EDSADC_CH13_FCNTC.
* To use register names with standard convension, please use EDSADC_CH13_FCNTC.
*/
#define EDSADC_FCNTC13 (EDSADC_CH13_FCNTC)

/** \brief E20, Integration Window Control Register ${i} */
#define EDSADC_CH13_IWCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024E20u)
/** Alias (User Manual Name) for EDSADC_CH13_IWCTR.
* To use register names with standard convension, please use EDSADC_CH13_IWCTR.
*/
#define EDSADC_IWCTR13 (EDSADC_CH13_IWCTR)

/** \brief E24, Intermediate Integration Value */
#define EDSADC_CH13_IIVAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024E24u)
/** Alias (User Manual Name) for EDSADC_CH13_IIVAL.
* To use register names with standard convension, please use EDSADC_CH13_IIVAL.
*/
#define EDSADC_IIVAL13 (EDSADC_CH13_IIVAL)

/** \brief E28, Integrator Status Register ${i} */
#define EDSADC_CH13_ISTAT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024E28u)
/** Alias (User Manual Name) for EDSADC_CH13_ISTAT.
* To use register names with standard convension, please use EDSADC_CH13_ISTAT.
*/
#define EDSADC_ISTAT13 (EDSADC_CH13_ISTAT)

/** \brief E2C, Result FIFO Control Register ${i} */
#define EDSADC_CH13_RFC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF0024E2Cu)
/** Alias (User Manual Name) for EDSADC_CH13_RFC.
* To use register names with standard convension, please use EDSADC_CH13_RFC.
*/
#define EDSADC_RFC13 (EDSADC_CH13_RFC)

/** \brief E30, Result Register ${i} Main */
#define EDSADC_CH13_RESM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024E30u)
/** Alias (User Manual Name) for EDSADC_CH13_RESM.
* To use register names with standard convension, please use EDSADC_CH13_RESM.
*/
#define EDSADC_RESM13 (EDSADC_CH13_RESM)

/** \brief E38, Offset Compensation Register ${i} */
#define EDSADC_CH13_OFFCOMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024E38u)
/** Alias (User Manual Name) for EDSADC_CH13_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH13_OFFCOMP.
*/
#define EDSADC_OFFCOMP13 (EDSADC_CH13_OFFCOMP)

/** \brief E3C, Gain Calibration Register ${i} */
#define EDSADC_CH13_GAINCAL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF0024E3Cu)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH13_GAINCAL.
*/
#define EDSADC_GAINCAL13 (EDSADC_CH13_GAINCAL)

/** \brief E40, Gain Control Register ${i} */
#define EDSADC_CH13_GAINCTR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024E40u)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH13_GAINCTR.
*/
#define EDSADC_GAINCTR13 (EDSADC_CH13_GAINCTR)

