Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_reg.h
/** \brief E44, Gain Correction Register ${i} */
#define EDSADC_CH13_GAINCORR /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_GAINCORR*)0xF0024E44u)
/** Alias (User Manual Name) for EDSADC_CH13_GAINCORR.
* To use register names with standard convension, please use EDSADC_CH13_GAINCORR.
*/
#define EDSADC_GAINCORR13 (EDSADC_CH13_GAINCORR)

/** \brief E50, Time-Stamp Register ${i} */
#define EDSADC_CH13_TSTMP /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSTMP*)0xF0024E50u)
/** Alias (User Manual Name) for EDSADC_CH13_TSTMP.
* To use register names with standard convension, please use EDSADC_CH13_TSTMP.
*/
#define EDSADC_TSTMP13 (EDSADC_CH13_TSTMP)

/** \brief E54, Time-Stamp Counter ${i} */
#define EDSADC_CH13_TSCNT /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_TSCNT*)0xF0024E54u)
/** Alias (User Manual Name) for EDSADC_CH13_TSCNT.
* To use register names with standard convension, please use EDSADC_CH13_TSCNT.
*/
#define EDSADC_TSCNT13 (EDSADC_CH13_TSCNT)

/** \brief E70, Filter Configuration Register ${i}, Auxiliary Filter */
#define EDSADC_CH13_FCFGA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024E70u)
/** Alias (User Manual Name) for EDSADC_CH13_FCFGA.
* To use register names with standard convension, please use EDSADC_CH13_FCFGA.
*/
#define EDSADC_FCFGA13 (EDSADC_CH13_FCFGA)

/** \brief E78, Boundary Select Register ${i} */
#define EDSADC_CH13_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024E78u)
/** Alias (User Manual Name) for EDSADC_CH13_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH13_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL13 (EDSADC_CH13_BOUNDSEL)

/** \brief E80, Result Register ${i} Auxiliary Filter */
#define EDSADC_CH13_RESA /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024E80u)
/** Alias (User Manual Name) for EDSADC_CH13_RESA.
* To use register names with standard convension, please use EDSADC_CH13_RESA.
*/
#define EDSADC_RESA13 (EDSADC_CH13_RESA)

/** \brief EA0, Carrier Generator Synchronization Register ${i} */
#define EDSADC_CH13_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024EA0u)
/** Alias (User Manual Name) for EDSADC_CH13_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH13_CGSYNC.
*/
#define EDSADC_CGSYNC13 (EDSADC_CH13_CGSYNC)

/** \brief EA8, Rectification Configuration Register ${i} */
#define EDSADC_CH13_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024EA8u)
/** Alias (User Manual Name) for EDSADC_CH13_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH13_RECTCFG.
*/
#define EDSADC_RECTCFG13 (EDSADC_CH13_RECTCFG)

/** \brief EB0, Common Mode Voltage Register ${i} */
#define EDSADC_CH13_VCM /*lint --e(923)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024EB0u)
/** Alias (User Manual Name) for EDSADC_CH13_VCM.
* To use register names with standard convension, please use EDSADC_CH13_VCM.
*/
#define EDSADC_VCM13 (EDSADC_CH13_VCM)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEDSADC_REG_H */
